Repository: alphateddyMH/custom-vat
Catalog: edd-custom-vat/languages/custom-vat-*_formal.po
Languages: de_de_formal

source: Custom VAT Settings
de_de_formal: Benutzerdefinierte MwSt.-Einstellungen

source: Custom VAT
de_de_formal: Benutzerdefinierte MwSt.

source: Settings
de_de_formal: Einstellungen

source: Custom VAT Configuration
de_de_formal: Benutzerdefinierte MwSt.-Konfiguration

source: Enable Custom VAT
de_de_formal: Benutzerdefinierte MwSt. aktivieren

source: Default VAT Rate
de_de_formal: Standard-MwSt.-Satz

source: VAT Number Field Label
de_de_formal: Bezeichnung für das USt-IdNr.-Feld

source: VAT Number Field Description
de_de_formal: Beschreibung für das USt-IdNr.-Feld

source: Enable VAT Validation
de_de_formal: MwSt.-Validierung aktivieren

source: Remove VAT for Valid Numbers
de_de_formal: MwSt. für gültige Nummern entfernen

source: Show VAT Field for Countries
de_de_formal: USt-IdNr.-Feld für Länder anzeigen

source: B2B Mode
de_de_formal: B2B-Modus

source: Debug Mode
de_de_formal: Debug-Modus

source: Custom VAT Rates
de_de_formal: Benutzerdefinierte MwSt.-Sätze

source: Enable or disable custom VAT functionality
de_de_formal: Benutzerdefinierte MwSt.-Funktionalität aktivieren oder deaktivieren

source: Set the default VAT rate (percentage)
de_de_formal: Legen Sie den Standard-MwSt.-Satz fest (Prozentsatz)

source: Label for the VAT number field at checkout
de_de_formal: Bezeichnung für das USt-IdNr.-Feld beim Checkout

source: Description for the VAT number field at checkout
de_de_formal: Beschreibung für das USt-IdNr.-Feld beim Checkout

source: Enable validation of VAT numbers
de_de_formal: Validierung von USt-IdNr. aktivieren

source: Remove VAT for customers with valid VAT numbers
de_de_formal: MwSt. für Kunden mit gültigen USt-IdNr. entfernen

source: Select countries where the VAT field should be shown
de_de_formal: Wählen Sie Länder aus, in denen das USt-IdNr.-Feld angezeigt werden soll

source: Enable B2B mode (always show VAT field)
de_de_formal: B2B-Modus aktivieren (USt-IdNr.-Feld immer anzeigen)

source: Enable debug mode for troubleshooting
de_de_formal: Debug-Modus zur Fehlerbehebung aktivieren

source: Configure custom VAT rates for specific countries
de_de_formal: Konfigurieren Sie benutzerdefinierte MwSt.-Sätze für bestimmte Länder

source: Country
de_de_formal: Land

source: VAT Rate (%)
de_de_formal: MwSt.-Satz (%)

source: Actions
de_de_formal: Aktionen

source: Add New Rate
de_de_formal: Neuen Satz hinzufügen

source: Remove
de_de_formal: Entfernen

source: Settings saved successfully.
de_de_formal: Einstellungen erfolgreich gespeichert.

source: Error saving settings.
de_de_formal: Fehler beim Speichern der Einstellungen.

source: Custom VAT Documentation
de_de_formal: Benutzerdefinierte MwSt.-Dokumentation

source: Getting Started
de_de_formal: Erste Schritte

source: Configuration
de_de_formal: Konfiguration

source: VAT Validation
de_de_formal: MwSt.-Validierung

source: Custom Rates
de_de_formal: Benutzerdefinierte Sätze

source: Troubleshooting
de_de_formal: Fehlerbehebung

source: Welcome to Custom VAT
de_de_formal: Willkommen bei Benutzerdefinierte MwSt.

source: This plugin allows you to customize VAT handling in your WooCommerce store. Below you'll find comprehensive documentation on how to set up and use the plugin.
de_de_formal: Dieses Plugin ermöglicht es Ihnen, die MwSt.-Handhabung in Ihrem WooCommerce-Shop anzupassen. Nachfolgend finden Sie eine umfassende Dokumentation zur Einrichtung und Verwendung des Plugins.

source: Basic Setup
de_de_formal: Grundeinrichtung

source: To get started with Custom VAT, follow these steps:
de_de_formal: Um mit Benutzerdefinierte MwSt. zu beginnen, folgen Sie diesen Schritten:

source: 1. Enable the plugin in the settings page
de_de_formal: 1. Aktivieren Sie das Plugin auf der Einstellungsseite

source: 2. Set your default VAT rate
de_de_formal: 2. Legen Sie Ihren Standard-MwSt.-Satz fest

source: 3. Configure the VAT number field that will appear at checkout
de_de_formal: 3. Konfigurieren Sie das USt-IdNr.-Feld, das beim Checkout erscheinen wird

source: 4. Select which countries should see the VAT field
de_de_formal: 4. Wählen Sie aus, welche Länder das USt-IdNr.-Feld sehen sollen

source: General Settings
de_de_formal: Allgemeine Einstellungen

source: The main settings page allows you to configure:
de_de_formal: Auf der Haupteinstellungsseite können Sie Folgendes konfigurieren:

source: - Default VAT Rate: The standard VAT percentage to apply
de_de_formal: - Standard-MwSt.-Satz: Der anzuwendende Standard-MwSt.-Prozentsatz

source: - VAT Field Label & Description: Customize how the field appears at checkout
de_de_formal: - USt-IdNr.-Feldbezeichnung & Beschreibung: Passen Sie an, wie das Feld beim Checkout erscheint

source: - Country Selection: Choose which countries should see the VAT field
de_de_formal: - Länderauswahl: Wählen Sie aus, welche Länder das USt-IdNr.-Feld sehen sollen

source: - B2B Mode: When enabled, the VAT field is always shown regardless of country
de_de_formal: - B2B-Modus: Wenn aktiviert, wird das USt-IdNr.-Feld unabhängig vom Land immer angezeigt

source: How Validation Works
de_de_formal: Wie die Validierung funktioniert

source: When VAT validation is enabled, the plugin will:
de_de_formal: Wenn die MwSt.-Validierung aktiviert ist, wird das Plugin:

source: 1. Check the format of the VAT number to ensure it matches the country's pattern
de_de_formal: 1. Das Format der USt-IdNr. überprüfen, um sicherzustellen, dass es dem Muster des Landes entspricht

source: 2. Verify the VAT number against the VIES database (for EU countries)
de_de_formal: 2. Die USt-IdNr. gegen die VIES-Datenbank überprüfen (für EU-Länder)

source: 3. Store the validation result with the order
de_de_formal: 3. Das Validierungsergebnis mit der Bestellung speichern

source: If 'Remove VAT for Valid Numbers' is enabled, customers with valid VAT numbers will have VAT removed from their order.
de_de_formal: Wenn 'MwSt. für gültige Nummern entfernen' aktiviert ist, wird bei Kunden mit gültigen USt-IdNr. die MwSt. von ihrer Bestellung entfernt.

source: Setting Up Custom Rates
de_de_formal: Einrichten benutzerdefinierter Sätze

source: You can set different VAT rates for specific countries:
de_de_formal: Sie können unterschiedliche MwSt.-Sätze für bestimmte Länder festlegen:

source: 1. Go to the 'Custom VAT Rates' section
de_de_formal: 1. Gehen Sie zum Abschnitt 'Benutzerdefinierte MwSt.-Sätze'

source: 2. Click 'Add New Rate'
de_de_formal: 2. Klicken Sie auf 'Neuen Satz hinzufügen'

source: 3. Select a country and enter the VAT rate
de_de_formal: 3. Wählen Sie ein Land aus und geben Sie den MwSt.-Satz ein

source: 4. Save your settings
de_de_formal: 4. Speichern Sie Ihre Einstellungen

source: These rates will override the default rate for the specified countries.
de_de_formal: Diese Sätze überschreiben den Standardsatz für die angegebenen Länder.

source: Common Issues
de_de_formal: Häufige Probleme

source: If you encounter problems with the plugin, try these steps:
de_de_formal: Wenn Sie Probleme mit dem Plugin haben, versuchen Sie diese Schritte:

source: 1. Enable Debug Mode in the settings to see detailed logs
de_de_formal: 1. Aktivieren Sie den Debug-Modus in den Einstellungen, um detaillierte Protokolle zu sehen

source: 2. Check that your server can connect to the VIES validation service
de_de_formal: 2. Überprüfen Sie, ob Ihr Server eine Verbindung zum VIES-Validierungsdienst herstellen kann

source: 3. Verify that your WooCommerce tax settings are compatible
de_de_formal: 3. Überprüfen Sie, ob Ihre WooCommerce-Steuereinstellungen kompatibel sind

source: 4. Clear your cache after making changes to settings
de_de_formal: 4. Löschen Sie Ihren Cache, nachdem Sie Änderungen an den Einstellungen vorgenommen haben

source: Frequently Asked Questions
de_de_formal: Häufig gestellte Fragen

source: Q: Will this plugin work with my theme?
de_de_formal: F: Wird dieses Plugin mit meinem Theme funktionieren?

source: A: Custom VAT is designed to be compatible with any properly coded WordPress theme.
de_de_formal: A: Benutzerdefinierte MwSt. ist so konzipiert, dass es mit jedem ordnungsgemäß programmierten WordPress-Theme kompatibel ist.

source: Q: Can I validate non-EU VAT numbers?
de_de_formal: F: Kann ich Nicht-EU-USt-IdNr. validieren?

source: A: Currently, full validation is only available for EU VAT numbers through the VIES system. For other countries, only format validation is performed.
de_de_formal: A: Derzeit ist die vollständige Validierung nur für EU-USt-IdNr. über das VIES-System verfügbar. Für andere Länder wird nur eine Formatvalidierung durchgeführt.

source: Q: Does this plugin modify my WooCommerce tax settings?
de_de_formal: F: Ändert dieses Plugin meine WooCommerce-Steuereinstellungen?

source: A: No, this plugin works alongside your existing WooCommerce tax settings. It adds the VAT field and validation functionality without changing your core tax configuration.
de_de_formal: A: Nein, dieses Plugin arbeitet neben Ihren bestehenden WooCommerce-Steuereinstellungen. Es fügt das USt-IdNr.-Feld und die Validierungsfunktionalität hinzu, ohne Ihre Kern-Steuerkonfiguration zu ändern.

source: Q: Can I use this with other tax plugins?
de_de_formal: F: Kann ich dies mit anderen Steuer-Plugins verwenden?

source: A: While the plugin should work with most tax plugins, we recommend testing compatibility in a staging environment first.
de_de_formal: A: Obwohl das Plugin mit den meisten Steuer-Plugins funktionieren sollte, empfehlen wir, die Kompatibilität zunächst in einer Staging-Umgebung zu testen.

source: VAT Number
de_de_formal: USt-IdNr.

source: Enter your VAT number if applicable
de_de_formal: Geben Sie Ihre USt-IdNr. ein, falls zutreffend

source: Please enter a valid VAT number.
de_de_formal: Bitte geben Sie eine gültige USt-IdNr. ein.

source: VAT number validation failed. Please check your input.
de_de_formal: USt-IdNr.-Validierung fehlgeschlagen. Bitte überprüfen Sie Ihre Eingabe.

source: VAT number has been validated successfully.
de_de_formal: USt-IdNr. wurde erfolgreich validiert.

source: VAT has been removed based on your valid VAT number.
de_de_formal: Die MwSt. wurde aufgrund Ihrer gültigen USt-IdNr. entfernt.

source: VAT number is valid.
de_de_formal: USt-IdNr. ist gültig.

source: VAT number is invalid.
de_de_formal: USt-IdNr. ist ungültig.

source: VAT validation service is currently unavailable.
de_de_formal: Der USt-IdNr.-Validierungsdienst ist derzeit nicht verfügbar.

source: Invalid country code in VAT number.
de_de_formal: Ungültiger Ländercode in der USt-IdNr.

source: VAT number format is invalid for this country.
de_de_formal: Das USt-IdNr.-Format ist für dieses Land ungültig.

source: Custom VAT requires WooCommerce to be installed and active.
de_de_formal: Benutzerdefinierte MwSt. erfordert, dass WooCommerce installiert und aktiv ist.

source: View Custom VAT Settings
de_de_formal: Benutzerdefinierte MwSt.-Einstellungen anzeigen

source: Documentation
de_de_formal: Dokumentation

source: VAT Number:
de_de_formal: USt-IdNr.:

source: VAT Status:
de_de_formal: MwSt.-Status:

source: Valid
de_de_formal: Gültig

source: Invalid
de_de_formal: Ungültig

source: Not Validated
de_de_formal: Nicht validiert

source: VAT Status
de_de_formal: MwSt.-Status

source: VAT Details
de_de_formal: MwSt.-Details

source: VAT Reports
de_de_formal: MwSt.-Berichte

source: VAT Summary
de_de_formal: MwSt.-Zusammenfassung

source: VAT by Country
de_de_formal: MwSt. nach Land

source: VAT Exemptions
de_de_formal: MwSt.-Befreiungen

source: Export Data
de_de_formal: Daten exportieren

source: VAT Collection Summary
de_de_formal: MwSt.-Erhebungszusammenfassung

source: This report shows a summary of VAT collected over time.
de_de_formal: Dieser Bericht zeigt eine Zusammenfassung der im Laufe der Zeit erhobenen MwSt.

source: Date Range:
de_de_formal: Datumsbereich:

source: Last 7 days
de_de_formal: Letzte 7 Tage

source: Last 30 days
de_de_formal: Letzte 30 Tage

source: This month
de_de_formal: Dieser Monat

source: Last month
de_de_formal: Letzter Monat

source: This quarter
de_de_formal: Dieses Quartal

source: Last quarter
de_de_formal: Letztes Quartal

source: This year
de_de_formal: Dieses Jahr

source: Last year
de_de_formal: Letztes Jahr

source: Custom
de_de_formal: Benutzerdefiniert

source: Apply
de_de_formal: Anwenden

source: Total VAT Collected:
de_de_formal: Insgesamt erhobene MwSt.:

source: Orders with VAT:
de_de_formal: Bestellungen mit MwSt.:

source: VAT Exemptions:
de_de_formal: MwSt.-Befreiungen:

source: Average VAT per Order:
de_de_formal: Durchschnittliche MwSt. pro Bestellung:

source: VAT Collection by Country
de_de_formal: MwSt.-Erhebung nach Land

source: This report shows VAT collected broken down by country.
de_de_formal: Dieser Bericht zeigt die erhobene MwSt. aufgeschlüsselt nach Ländern.

source: Orders
de_de_formal: Bestellungen

source: VAT Collected
de_de_formal: Erhobene MwSt.

source: Average Rate
de_de_formal: Durchschnittlicher Satz

source: VAT Exemption Report
de_de_formal: MwSt.-Befreiungsbericht

source: This report shows orders where VAT was exempted due to valid VAT numbers.
de_de_formal: Dieser Bericht zeigt Bestellungen, bei denen die MwSt. aufgrund gültiger USt-IdNr. befreit wurde.

source: Order ID
de_de_formal: Bestellnummer

source: Date
de_de_formal: Datum

source: Customer
de_de_formal: Kunde

source: Order Total
de_de_formal: Bestellsumme

source: VAT Exempted
de_de_formal: MwSt. befreit

source: Export VAT Data
de_de_formal: MwSt.-Daten exportieren

source: Generate reports for your VAT records and accounting.
de_de_formal: Generieren Sie Berichte für Ihre MwSt.-Aufzeichnungen und Buchhaltung.

source: Report Type:
de_de_formal: Berichtstyp:

source: Complete VAT Report
de_de_formal: Vollständiger MwSt.-Bericht

source: VAT Exemptions Only
de_de_formal: Nur MwSt.-Befreiungen

source: Generate Report
de_de_formal: Bericht generieren

source: VAT validation request failed.
de_de_formal: USt-IdNr.-Validierungsanfrage fehlgeschlagen.

source: Invalid response from VAT validation service.
de_de_formal: Ungültige Antwort vom USt-IdNr.-Validierungsdienst.

source: VAT number is not registered or is invalid.
de_de_formal: USt-IdNr. ist nicht registriert oder ungültig.

source: VAT validation service returned an error.
de_de_formal: Der USt-IdNr.-Validierungsdienst hat einen Fehler zurückgegeben.
